//5․ Տրված է ամբողջ թվերի հաջորդականություն։ Արտածել այդ հաջորդականության դրական տարրերից փոքրագույնի արժեքը (եթե դրական տարր չկա արտածել համապատասխան հաղորդագրություն)։

var arr = [-2, -1, -5, -2, -3, 100, -1, -3, -5, -1];
var minIndex = 0;

for (var i = 0; i < arr.length; ++i) {
    if ((arr[minIndex] > arr[i] && arr[i] > 0) || (arr[minIndex] < 0 && arr[i] > 0)) {
        minIndex = i; 
    }
}
if (arr[minIndex] > 0) {
    alert(arr[minIndex]);
} else { 
    alert ('Փոքրագույն արժեք գոյություն չունի');
}